org/tools/arch-linux.org
#+setupfile:./hugo_setup.org
#+hugo_slug: arch-linux
#+TITLE: Arch Linux

Arch Linux is a popular, flexible Linux distribution.
It's a /rolling release/ distribution. This means that it always has the newest versions of packages and the linux kernel.

The AUR, or Arch User Repositories, provide probably the widest selection of packages available from any Linux distribution, as it's incredibly easy for end users of Arch to create, publish and maintain them relative to other distributions.

I no longer use the system because I've become frustrated with Linux's approach to configuration and package management. As such, I'm now using NixOS.

* Derivatives
[[https://github.com/archcraft-os/archcraft][Archcraft]]
https://github.com/BlackArch/blackarch arch for pentesters

* Tools
https://github.com/fosskers/aura is a package manager for Arch and the AUR
https://github.com/ibrahimbutt/direwolf-arch-rice scripts for ricing arch
